class Message:
    PickLight = 0
    PickUpgradeHP = 1
    PickUpgradeLightLevel = 2
    PickUpgradeLightAmount = 3
    PickUpgradeTimeLimit = 4
    PickHeal = 5
    LoseTitle = 6

    default_msg = '<Текст сообщения не найден>'
    msgs = {
        PickLight: 'Подобрано: Фонарь',
        PickUpgradeHP: ['Невозможно применить улучшение Max HP: достигнут предел', 'Улучшение: Max HP'],
        PickUpgradeLightLevel: ['Невозможно применить улучшение Освещение: достигнут предел', 'Улучшение: Освещение'],
        PickUpgradeLightAmount: ['Невозможно применить улучшение Количество фонарей: достигнут предел', 'Улучшение: Количество фонарей'],
        PickUpgradeTimeLimit: ['Невозможно применить улучшение Время обнаружения: достигнут предел', 'Улучшение: Время обнаружения'],
        PickHeal: 'Восстановлено 10% HP',
        LoseTitle: 'Вирус обезврежен'
    }

    @classmethod
    def text(cls, msg_type):
        return cls.msgs.get(msg_type, cls.default_msg)


LOGO_1 = [
    r"  ____          _        ____                                          ",
    r" / ___|___   __| | ___  |  _ \ _   _ _ __   __ _  ___  ___  _ __       ",
    r"| |   / _ \ / _` |/ _ \ | | | | | | | '_ \ / _` |/ _ \/ _ \| '_ \      ",
    r"| |__| (_) | (_| |  __/ | |_| | |_| | | | | (_| |  __/ (_) | | | |     ",
    r" \____\___/ \__,_|\___| |____/ \__,_|_| |_|\__, |\___|\___/|_| |_|____ ",
    r"                                           |___/                |_____|"
]

LOGO_2 = [
    r"  ____          _        ____                                          ",
    r" / ___|___   __| | ___  |  _ \ _   _ _ __   __ _  ___  ___  _ __       ",
    r"| |   / _ \ / _` |/ _ \ | | | | | | | '_ \ / _` |/ _ \/ _ \| '_ \      ",
    r"| |__| (_) | (_| |  __/ | |_| | |_| | | | | (_| |  __/ (_) | | | |     ",
    r" \____\___/ \__,_|\___| |____/ \__,_|_| |_|\__, |\___|\___/|_| |_|     ",
    r"                                           |___/                       "
]
